In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
np.random.seed(101)

In [10]:
df = pd.DataFrame(np.random.randn(5,4), ["A", "B", "C", "D", "E"], ["W", "X", "Y", "Z"])
df

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [43]:
# SELECT COLUMN
df["W"]

A    1.606780
B    0.041460
C   -0.804652
D   -1.080471
E    0.975720
Name: W, dtype: float64

In [44]:
df["new"] = np.random.randn(5,1)
df

          W         X         Y         Z       new
A  1.606780 -1.115710 -1.385379 -1.329660 -0.971393
B  0.041460 -0.411055 -0.771329  0.110477 -1.522333
C -0.804652  0.253548  0.649148  0.358941  1.133703
D -1.080471  0.902398  0.161781  0.833029  0.528187
E  0.975720 -0.388239  0.783316 -0.708954  0.393461

In [45]:
df.drop("new", axis=1) # pass in argument inplace=True => to replace original data

          W         X         Y         Z
A  1.606780 -1.115710 -1.385379 -1.329660
B  0.041460 -0.411055 -0.771329  0.110477
C -0.804652  0.253548  0.649148  0.358941
D -1.080471  0.902398  0.161781  0.833029
E  0.975720 -0.388239  0.783316 -0.708954

In [46]:
df.drop("A", axis=0)

          W         X         Y         Z       new
B  0.041460 -0.411055 -0.771329  0.110477 -1.522333
C -0.804652  0.253548  0.649148  0.358941  1.133703
D -1.080471  0.902398  0.161781  0.833029  0.528187
E  0.975720 -0.388239  0.783316 -0.708954  0.393461

In [47]:
# SELECT ROW

In [58]:
df.loc[["A", "B"], ["W", "Y"]] # df.loc[ROW_NAMES_RANGE, COL_NAMES_RANGE]

         W         Y
A  1.60678 -1.385379
B  0.04146 -0.771329

In [57]:
df.iloc[0, :3] # df.loc[ROW_NAMES_INDEX_RANGE, COL_NAMES_INDEX_RANGE]

W    1.606780
X   -1.115710
Y   -1.385379
Name: A, dtype: float64